In [1]:
from sqlalchemy import create_engine
import pandas as pd
import numpy as np

In [2]:
def connect_to_database():
    """Function for connecting to the SQL database"""

    # Create variables to store cretentials
    USER = "admin"
    DB = "dbikes"
    PORT = "3306"
    URL = "database-1.ctesjcult8dm.eu-west-1.rds.amazonaws.com"

    # Read in password from text file
    with open('../mysql_password.txt') as f:
        PASSWORD = ''.join(f.readlines())
        PASSWORD = str(PASSWORD).split()[0]

    # Create engine using credentials
    engine = create_engine(
        "mysql+mysqlconnector://{}:{}@{}:{}/{}".format(USER, PASSWORD, URL, PORT, DB), echo=True)

    # Create connection using engine and return connection
    conn = engine.connect()
    return conn

In [3]:
engine = connect_to_database()

2022-03-23 14:08:47,233 INFO sqlalchemy.engine.Engine SHOW VARIABLES LIKE 'sql_mode'
2022-03-23 14:08:47,235 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-03-23 14:08:47,254 INFO sqlalchemy.engine.Engine SHOW VARIABLES LIKE 'lower_case_table_names'
2022-03-23 14:08:47,255 INFO sqlalchemy.engine.Engine [generated in 0.00659s] {}
2022-03-23 14:08:47,290 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2022-03-23 14:08:47,291 INFO sqlalchemy.engine.Engine [raw sql] {}

In [4]:
availability_df = pd.read_sql_query("SELECT * FROM dbikes.availability", engine)
availability_df.head()

2022-03-23 14:08:47,453 INFO sqlalchemy.engine.Engine SELECT * FROM dbikes.availability
2022-03-23 14:08:47,455 INFO sqlalchemy.engine.Engine [raw sql] {}

   number  available_bikes  available_stands    last_update
0      42               17                13  1644921618000
1      30               15                 5  1644922002000
2      54               16                17  1644922012000
3     108               10                25  1644921926000
4      56                9                31  1644922071000

In [5]:
availability_df.shape

(2827330, 4)

In [6]:
# Remove duplicates
availability_df.drop_duplicates(inplace=True)

In [7]:
print(availability_df.shape)
# availability_df.duplicated().sum()

(718191, 4)

In [8]:
weather_df = pd.read_sql_query("SELECT dt, temperature, main FROM dbikes.real_time_weather", engine)
weather_df.head(40)

2022-03-23 14:09:12,901 INFO sqlalchemy.engine.Engine SELECT dt, temperature, main FROM dbikes.real_time_weather
2022-03-23 14:09:12,904 INFO sqlalchemy.engine.Engine [raw sql] {}

            dt  temperature    main
0   1644922267          280  Clouds
1   1644922316          280  Clouds
2   1644922617          280  Clouds
3   1644922917          280  Clouds
4   1644923217          280  Clouds
5   1644923518          280  Clouds
6   1644923818          281  Clouds
7   1644924118          281  Clouds
8   1644924418          281  Clouds
9   1644924719          281  Clouds
10  1644925019          281  Clouds
11  1644925320          281  Clouds
12  1644925620          281  Clouds
13  1644925920          281  Clouds
14  1644926221          281  Clouds
15  1644926521          281  Clouds
16  1644926821          281  Clouds
17  1644927122          281  Clouds
18  1644927422          281  Clouds
19  1644927723          281  Clouds
20  1644928023          281  Clouds
21  1644928323          281  Clouds
22  1644928623          281  Clouds
23  1644928924          281  Clouds
24  1644929224          281  Clouds
25  1644929524          281  Clouds
26  1644929824          281  Clouds
27  1644930125          281  Clouds
28  1644930425          281  Clouds
29  1644930725          281  Clouds
30  1644931025          281  Clouds
31  1644931326          281  Clouds
32  1644931626          281  Clouds
33  1644931926          281  Clouds
34  1644932227          281  Clouds
35  1644932527          281  Clouds
36  1644932827          281  Clouds
37  1644933127          281  Clouds
38  1644933428          281  Clouds
39  1644933728          281  Clouds

In [9]:
#Drop duplicates
weather_df.drop_duplicates(inplace=True)

In [10]:
print(weather_df.shape)

(10398, 3)

In [11]:
#Changes the name of the column
availability_df.rename(columns={"last_update": "dt"}, inplace=True)
availability_df.columns

Index(['number', 'available_bikes', 'available_stands', 'dt'], dtype='object')

In [12]:
availability_df["dt"] = availability_df["dt"].astype(np.int64)
availability_df.dtypes

number              int64
available_bikes     int64
available_stands    int64
dt                  int64
dtype: object

In [13]:
weather_df["dt"]= weather_df["dt"].astype(np.int64)
weather_df.dtypes

dt              int64
temperature     int64
main           object
dtype: object

In [14]:
availability_df.sort_values(by="dt", inplace=True)
weather_df.sort_values(by="dt", inplace=True)

In [15]:
#Converts seconds to miliseconds
availability_df["dt"] = availability_df["dt"] // 1000
availability_df.head()

    number  available_bikes  available_stands          dt
86      86                0                38  1644921498
34      55               14                21  1644921501
98      80               22                18  1644921515
7       32               15                15  1644921522
30      99               15                15  1644921535

In [16]:
df=pd.merge_asof(availability_df, weather_df, on="dt", direction="nearest")
df.head(20)

    number  available_bikes  available_stands          dt  temperature    main
0       86                0                38  1644921498          280  Clouds
1       55               14                21  1644921501          280  Clouds
2       80               22                18  1644921515          280  Clouds
3       32               15                15  1644921522          280  Clouds
4       99               15                15  1644921535          280  Clouds
5      115                0                30  1644921543          280  Clouds
6        9               24                 0  1644921545          280  Clouds
7       18               18                12  1644921589          280  Clouds
8       39                8                12  1644921597          280  Clouds
9       13               15                15  1644921598          280  Clouds
10      62               19                21  1644921599          280  Clouds
11     117                8                32  1644921605          280  Clouds
12      12                0                20  1644921618          280  Clouds
13      42               17                13  1644921618          280  Clouds
14      82                6                16  1644921620          280  Clouds
15     107                0                40  1644921623          280  Clouds
16      28               10                20  1644921624          280  Clouds
17      65                3                37  1644921633          280  Clouds
18      40               15                 6  1644921636          280  Clouds
19      95               13                27  1644921644          280  Clouds

In [17]:
df.shape

(718191, 6)

In [18]:
df["temperature"] = df["temperature"] - 273.15
df

,number,available_bikes,available_stands,dt,temperature,main
0,86,0,38,1644921498,6.85,Clouds
1,55,14,21,1644921501,6.85,Clouds
2,80,22,18,1644921515,6.85,Clouds
3,32,15,15,1644921522,6.85,Clouds
4,99,15,15,1644921535,6.85,Clouds
...,...,...,...,...,...,...
718186,23,29,1,1648044418,15.85,Clear
718187,47,24,16,1648044423,15.85,Clear
718188,109,1,28,1648044435,15.85,Clear
718189,11,16,14,1648044439,15.85,Clear
718190,52,4,28,1648044441,15.85,Clear

In [19]:
df["temperature"].value_counts()

 7.85     125364
 8.85     100116
 6.85      89276
 5.85      75979
 4.85      58264
 3.85      49589
 9.85      46716
 10.85     38398
 2.85      36476
 1.85      24514
 11.85     18931
 12.85     16984
 0.85      15828
-0.15       9559
 14.85      4236
 13.85      4060
 15.85      2936
-1.15        965
Name: temperature, dtype: int64

In [20]:
df["main"].value_counts()

Clouds     605989
Rain        62730
Clear       32832
Drizzle     13784
Snow         1844
Mist         1012
Name: main, dtype: int64